package day11;

public class day11 {

}

//                                
// ■ 추상클래스 (abstract class) : 클래스가 설계도라면, 추상클래스는 '미완성 설계도'
// 								 추상메서드(미완성 메서드)를 포함하고 있는 클래스
// 								    ↑ 선언부만 있고 구현부(몸통,body)가 없는 메세드
//                                  	ex) abstract void play(int pos);
//                                   	ex) abstract void stop();

//	 - 일반메서드가 추상메서드를 호출할 수 있다. (호출할때 필요한건 선언부)
//	 - 완성된 설계도가 아니므로 인스턴스를 생성할 수 없다. 
//	 - 다른 클래스를 작성하는 데 도움을 줄 목적으로 작성된다.
//
//
//
//
//
//
//
//
//
